In [3]:
import pandas as pd

In [4]:
data ={
    "names":['a','b','c'],
    "ages":[25,28,21]
}

In [5]:
df=pd.DataFrame(data)

In [6]:
df

  names  ages
0     a    25
1     b    28
2     c    21

In [7]:
df.head(2)

  names  ages
0     a    25
1     b    28

In [8]:
df.tail(2)

  names  ages
1     b    28
2     c    21

In [9]:
df.describe()

            ages
count   3.000000
mean   24.666667
std     3.511885
min    21.000000
25%    23.000000
50%    25.000000
75%    26.500000
max    28.000000

In [11]:
df.dtypes

names    object
ages      int64
dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   ages    3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [13]:
df.columns=["emp_name","age"]

In [15]:
df

  emp_name  age
0        a   25
1        b   28
2        c   21

In [17]:
df2=df.rename(columns={"emp_name":"emp_firstname", "age":"emp_age"})

In [18]:
df2

  emp_firstname  emp_age
0             a       25
1             b       28
2             c       21

In [19]:
dept=["sales","marketing","IT"]

In [20]:
df.assign(Company=dept)

  emp_name  age    Company
0        a   25      sales
1        b   28  marketing
2        c   21         IT

In [21]:
df.dtypes

emp_name    object
age          int64
dtype: object

In [22]:
df2=df.assign(Company=dept)

In [23]:
df2.dtypes

emp_name    object
age          int64
Company     object
dtype: object

In [24]:
df3=df2.convert_dtypes()

In [25]:
df3.dtypes

emp_name    string
age          Int64
Company     string
dtype: object

In [26]:
df4=df2.astype({"age":float})

In [27]:
df4.dtypes

emp_name     object
age         float64
Company      object
dtype: object

In [29]:
df.shape

(3, 2)

In [30]:
df.shape[0]

3

In [31]:
df.shape[1]

2

In [32]:
course = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }

In [33]:
df=pd.DataFrame(course)

In [34]:
df

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1200
3   Python  22000   40days      2500
4   pandas  24000   60days      2000

In [36]:
index_label=["r1","r2","r3","r4","r5"]

In [37]:
df5=pd.DataFrame(course, index=index_label)

In [38]:
df5

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

df.loc[start:stop:step, start:stop:step]
         select rows     select columns

In [40]:
df5.loc['r1']

Courses     Spark
Fee         20000
Duration    30day
Discount     1000
Name: r1, dtype: object

In [42]:
df5.loc[['r1','r2']]

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300

In [43]:
df5.loc[:,['Courses']]

    Courses
r1    Spark
r2  PySpark
r3   Hadoop
r4   Python
r5   pandas

In [45]:
df5.loc["r2":"r4"]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500

In [46]:
df5.loc[df5["Fee"]>=23000]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r5   pandas  24000   60days      2000

In [47]:
df5.query("Courses=='PySpark'")

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300

In [48]:
df5.query("Courses!='PySpark'")

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200
r4  Python  22000   40days      2500
r5  pandas  24000   60days      2000

In [51]:
dp=pd.read_csv("emp.csv")

In [52]:
dp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308.0,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933.0,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590.0,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705.0,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004.0,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
996,Phillip,Male,1/31/1984,6:30 AM,42392.0,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914.0,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500.0,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949.0,10.169,True,Sales
1000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [53]:
dp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   float64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(2), object(6)
memory usage: 62.7+ KB

In [54]:
dp.describe()

              Salary      Bonus %
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

In [56]:
dp.isnull()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,True
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
996,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False
1000,True,True,True,True,True,True,True,True

In [55]:
dp.isnull().sum()

First Name            68
Gender               146
Start Date             1
Last Login Time        1
Salary                 1
Bonus %                1
Senior Management     68
Team                  44
dtype: int64

In [58]:
dp["Gender"]=dp["Gender"].fillna("No gender")

In [59]:
dp.isnull().sum()

First Name           68
Gender                0
Start Date            1
Last Login Time       1
Salary                1
Bonus %               1
Senior Management    68
Team                 44
dtype: int64

In [60]:
dp.to_csv("finaldp")

In [61]:
dp.groupby(["Gender"]).count()

,First Name,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
Gender,,,,,,,
Female,400,431,431,431,431,400,418
Male,395,424,424,424,424,395,398
No gender,138,145,145,145,145,138,141

In [62]:
dp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308.0,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933.0,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590.0,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705.0,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004.0,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
996,Phillip,Male,1/31/1984,6:30 AM,42392.0,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914.0,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500.0,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949.0,10.169,True,Sales
1000,NaN,No gender,NaN,NaN,NaN,NaN,NaN,NaN

In [63]:
dp["Senior Management"]=dp["Senior Management"].fillna(dp["Senior Management"].mode()[0])

In [64]:
dp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308.0,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933.0,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590.0,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705.0,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004.0,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
996,Phillip,Male,1/31/1984,6:30 AM,42392.0,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914.0,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500.0,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949.0,10.169,True,Sales
1000,NaN,No gender,NaN,NaN,NaN,NaN,True,NaN

In [65]:
dp.to_csv("finaldp")